@extends('admin.layout.layout')
@section('title', 'Asosiy')

@section('content')

    <div class="app-content content ">
        <div class="content-overlay"></div>
        <div class="header-navbar-shadow"></div>
        <div class="content-wrapper">


            <div class="content-body">
                <!-- Tabs with Icon starts -->
                <div class="col-xl-12 col-lg-12">
                    <div class="card">
                        <div class="card-body">

                         <div id="print">
                             <h2 class="text-center">ТОВАРЛАРНИ НАСИЯГА СОТИШ БЎЙИЧА КЕЛИШУВ</h2>
                             <br>
                             <h2 class="text-center"> ШАРТНОМАСИ №{{$data->id}} </h2>
                             <div class="row w-100">
                                <h3 class="text-left">{{$store->address}}</h3>
                                <h3 class="text-right ml-auto">{{$data->created_at}}</h3>
                             </div>
                            <p>Якка тартибдаги тадбиркор «"SHIVAKI GROUP" М.Ч.Ж.» бир томондан (кейинги ўринларда “Сотувчи” деб аталувчи)
                                хамда Андижон
                                Олтинкул туман да истиқомат қилувчи фуқаро {{$data->costumer->passport_surname}} {{$data->costumer->costumer_name}} {{$data->costumer->phone}} паспорт {{$data->costumer->passport_number}}
                                {{$data->costumer->given_by_whom}} томонидан {{$data->costumer->date_of_issue}}  йилда берилган  (кейинги ўринларда “Харидор” деб аталувчи)
                                иккинчи томондан Ўзбекистон Республикаси Фуқаролик
                                Кодексининг 422-моддасига кўра мазкур шартномани қуйидаги мазмунда туздилар:</p>
                            <h2 class="text-center">1. ШАРТНОМА ПРЕДМЕТИ.</h2>
                             <p>1.1.“Сотувчи, “Харидор” га {{$data->created_at}} йилгача бўлган муддатга хар ойда бўлиб-бўлиб тўлаш шарти билан куйидаги истеъмол товарлари, уй-рўзғор буюмларини етказиб беради:</p>
                             <table class="table table-bordered">
                                 <thead>
                                    <tr>
                                        <th>№</th>
                                        <th>Махсулот номи</th>
                                        <th>Улчов бирлиги</th>
                                        <th>Микдори</th>
                                        <th>Нархи</th>
                                        <th>Умумий суммаси</th>
                                    </tr>
                                 </thead>
                                 <tbody>
                                    @foreach($productModels as $item)
                                    <tr>
                                        <td>{{$loop->iteration}}</td>
                                        <td>{{$item[0]->name}}</td>
                                        <td>Дона</td>
                                        <td>1</td>
                                        <td>{{number_format($item[0]->price)}}</td>
                                    </tr>
                                 @endforeach
                                 </tbody>
                                 <tfoot>
                                     <tr class="text-center">
                                         <td colspan="5">Жами</td>
                                         <td>{{number_format($data->sum)}}</td>
                                     </tr>
                                 </tfoot>
                             </table>
                             <p>1.2. “Харидор”, “Сотувчи” га олинаётган юкоридаги истеъмол товарлари, уй-рўзғор буюмларининг умумий суммасига нисбатан 0 (ноль)% микдорида комиссия тўлови тўлайди.</p>
                             <p>1.3. “Сотувчи “ умумий суммани ҳар ойда бўлиб-бўлиб
                                 тўлаш кўрсатилган икки нусхада ушбу шартноманинг ажралмас қисми
                                 ҳисобланувчи тўлов жадвали (кейинги уринларда “Тўлов жадвали” деб юритилади)
                                 тузади ва бир нусхасини “Харидор”га тақдим этади.
                                 1.4. Ушбу шартнома томонларнинг ўзаро келишувларига кўра хеч қандай мажбурлаш
                                 ва тазйиқларсиз ихтиёрий равишда тузилди. Шартномани имзолаш вақтида
                                 томонларнинг муомалага лаёқатсизлик холатлари аниқланмади.
                             </p>
                            <h2 class="text-center">2. КЕЛИШУВ ШАРТНОМА ТАЪМИНОТИ.</h2>
                             <p>2.1. “Харидорга” берилган ушбу шартноманинг 1.1.
                                 пунктида курсатиб утилган истеъмол товарлари, уй-рузгор
                                 буюмлари мазкур келишув шартномасида курсатилган “Харидор” томонидан тулаши лозим булган
                                 туловларнинг таъминоти сифатида ҳисобга олинади.
                                 2.2. “Харидор” томонидан бошка таъминот турлари хам кушимча сифатида такдим килиниши мумкин.
                             </p>
                            <h2 class="text-center">3. ОЛИНГАН ИСТЕЪМОЛ ТОВАРЛАРИ, УЙ-РЎЗҒОР БУЮМЛАРИ УЧУН  ПУЛ
                                МАБЛАҒЛАРИНИ ТЎЛАШ ТАРТИБИ.</h2>
                             <p>3.1. “Харидор” олинган истеъмол товарлари, уй-рўзғор буюмларини пул
                                 маблағларини шартноманинг ажралмас қисми ҳисобланган “Тўлов жадвалига”
                                 асосан кўрсатилган муддатларда ва микдорларда белгиланган тартибда тулик тўлайди.
                                 3.2.“Харидор”олинган истеъмол товарлари,уй-рўзғор буюмлари учун туловларни
                                 нақд пул,банк пластик  карточкаси орқали туловларни амалга ошириши мумкин.
                                 Харидорнинг иш жойидаги бухгалтерияга берган аризасига кўра унинг иш хақидан
                                 ёки бошқа даромадлари хисобига (шунингдек, ходимдан чегириб колинган маблаглар хисобига)
                                 алохида холатларда кафолат берувчи ва кафиллик берувчиларнинг маблағлари хисобидан
                                 (қонунчиликда белгиланган тартибда).
                             </p>
                            <h2 class="text-center">4. ТОМОНЛАРНИНГ ХУҚУҚ ВА МАЖБУРИЯТЛАРИ.</h2>
                            <p>4.1.1.“Харидор” ушбу келишув шартномасига таалуқли бўлган барча масалалар бўйича “Сотувчи”дан маслахат олади ва шартномага ўзгариш киритилишига таалуқли бўлган барча хуқуқий ўзгаришлар бўйича ўз вақтида маълумот олиши мумкин.
                                4.1.2.Харидор ўз имкониятларидан келиб чиқиб, қарз суммасини муддатидан олдин сўндириши мумкин.

                                4.1.3. Таъминотга олинган истеъмол товарлари, уй-рузгор буюмларини бут ҳолда сақлайди.

                                4.1.4. Таъминотга олинган мулкни “Сотувчи” олдидаги мажбуриятларини тўлиқ бажаргунга қадар сотмайди ёки бошқа шахсларга такдим этмайди.
                                4.1.5.“Харидор” тулов жадвали бўйича туловларни ўз вақтида тўлаш имконияти бўлмаган тақдирда таъминотга қўйилган мулкларни сотиш ҳуқуқини белгиланган тартибда “Сотувчи” га тақдим этади.

                                4.1.6. “Харидор” узининг яшаш манзили ёки иш жойи ўзгарганда, 5 (беш) иш куни давомида ёзма равишда “Сотувчи”ни ҳабардор қилади.
                                4.2.1.Харидорнинг даромадларини унинг яшаш манзилига ёки иш жойига бориб ўрганиш.
                                4.2.2. “Харидор”дан қарздорлик таъминотига қўйилган мулкларни бус-бутун сақланишини талаб қилиш ва лозим топса жойига чикиб урганиш.
                                4.2.3. “Харидор” нинг кредит тарихини ва бошка мажбуриятларини ўрганиш максадида тегишли жойлардан, мутасадди идоралардан, банклардан “Харидор” тугрисида маълумотлар олишга хакли.
                                4.2.4.Харидор тўлов жадвали бўйича туловларни ўз вақтида амалга оширмаса ёки сурункали равишда кечикиб тулашни давом эттирса, бу хакда “Харидор” нинг яшаш манзилига, у яшовчи КФЙ ёки МФЙ мутасадди ходимларига, “Харидор” нинг иш жойи рахбарига ёзма хабар бериш, ёзма равишда огохлантириш хатлари, маълумотномалар юбориш ва туловларнинг жами суммасини муддатидан олдин кайтарилишини Харидордан талаб килиш.
                                4.2.5. “Харидор” “Сотувчи ” олдидаги туловлар буйича мажбуриятларини 90 кун мобайнида тўлик ёки лозим даражада (уз ихтиёри билан) бажармаса, Узбекистон Республикаси Фукаролик Кодекси ва бошка конунчилик хужжатларига асосан карздорликни ундириш чораларини куриш.
                                4.2.6.Сотувчи ушбу шартномага ўзгариш киритилишига таалуқли бўлган барча янги меъёрий хужжатлар, қонунчиликдаги ўзгаришлар билан “Харидор”ни ҳабардор қилиб боради.

                                4.2.7.Сотувчи, Харидор томонидан белгиланган микдорда олдиндан тулов
                                амалга оширилгач купи билан 30 кун мобайнида мазкур келишув шартномасида
                                курсатилган товарларни “Харидор” га такдим этади ёки  бошка товарларни олишни
                                таклиф килади.
                            </p>
                            <h2 class="text-center">5. ШАРТНОМАНИНГ АМАЛ ҚИЛИШ МУДДАТИ.</h2>
                            <p>5.1. Шартнома томонлардан хар иккала тараф тулик имзолагандагина кучга киради ва ундаги
                                шартлар хакикий хисобланади.

                                5.2.Шартнома Харидорни Сотувчи олдидаги мажбурияти тўлиқ тўлангунга қадар амал қилади
                            </p>
                            <h2 class="text-center">6. ФОРС-МАЖОР.</h2>
                            <p>6.1. Томонларга тегишли бўлмаган Форс-мажор ҳолатлари: қаттиқ бўрон, ер силкиниши,
                                кўп миқдорда қор ёғиши ёки техник–электрон тизимнинг ишдан чиқиши, табиий офатлар ва
                                бошқа фавқулотда ҳолатлар содир бўлса,
                                шартнома мажбуриятларини бажарилиши форсмажор ҳолатлари тугагунга қадар вактинча тўхтатилади.
                            </p>
                            <h2 class="text-center">7. АЛОХИДА ШАРТЛАР.</h2>
                            <p>7.1.Ушбу шартномага мувфиқ сотилган товарларни олиб кетиш (транспортировка),
                                жихозлаш ва бошқа шу каби  харажатлар “Харидор” нинг ўз маблағлари хисобидан амалга оширилади.

                                7.2. Ушбу келишув шартноманинг амал килиш муддати давомида “Харидор” билан унинг
                                иш берувчиси уртасида тузилган мехнат шартномаси бекор килинган холларда, “Тулов жадвали”
                                курсатиб утилган карздорликлар «Харидор» томонидан муддатидан олдин тулик сундирилади. Иш берувчи
                                эса ушбу карздорликни ходим билан охирги хисоб-китоб килиш давомида ушлаб колиши ва «Сотувчи» нинг
                                хисоб ракамига ходим – «Харидор» нинг карздорлигини сундириш учун утказиб бериши мумкин.
                                7.3.Ушбу шартномага кушимча ва ўзгартиришлар киритиш томонларнинг ёзма келишувларига асосан амалга оширилади.
                            </p>
                            <h2 class="text-center">8. НИЗОЛАРНИ ХАЛ ҚИЛИШ ТАРТИБИ.</h2>
                            <p>8.1. Ушбу шартнома бўйича вужудга келган низолар томонларнинг ўзаро келишувига кура ёки Ўзбекистон
                                Республикаси қонунчилигига асосан белгиланган тартибда хал қилинади.</p>
                            <h1 class="text-center">ТОМОНЛАРНИНГ ЮРИДИК МАНЗИЛЛАРИ:</h1>
                             <div class="d-flex">
                                 <table class="table table-bordered">
                                     <thead>
                                        <th>“СОТУВЧИ”</th>
                                     </thead>
                                     <tbody>
                                     <tr>
                                         <td>Хусусий тадбиркор</td>
                                     </tr>
                                     <tr>
                                         <td>"SHIVAKI GROUP" М.Ч.Ж.</td>
                                     </tr>
                                      <tr>
                                          <td>Манзили ва реквизитлари</td>
                                      </tr>
                                       <tr><td>{{$store->address}} </td></tr>
                                       <tr><td>{{$store->phone}}</td></tr>
                                       <tr><td>Х/Р:{{$store->account_number}}</td></tr>
                                       <tr><td> МФО:01114  ИНН:{{$store->inn}}</td></tr>
                                       <tr><td>{{$store->name}}</td></tr>
                                        <tr><td>МУ. рахбар ____________</td></tr>
                                     </tbody>
                                 </table>
                                 <table class="table table-bordered ml-2">
                                     <thead>
                                        <th>“ХАРИДОР”</th>
                                     </thead>
                                     <tbody>
                                        <tr> <td>Фуқаро:</td></tr>
                                        <tr><td>{{$data->costumer->passport_surname}} {{$data->costumer->costumer_name}} {{$data->costumer->phone}}</td></tr>
                                        <tr><td>Манзили ва паспорт маълумотлари</td></tr>
                                        <tr><td>{{$data->costumer->register_address}}</td></tr>
                                        <tr><td>Паспорт: {{$data->costumer->passport_number}} {{$data->costumer->date_of_issue}}</td></tr>
                                        <tr><td>{{$data->costumer->given_by_whom}}</td></tr>
                                        <tr><td>Тел: {{$data->costumer->phone}}</td></tr>
                                        <tr><td>имзо ____________</td></tr>
                                     </tbody>
                                 </table>
                             </div>
                         </div>
                        <div class="col-12 mt-3 d-flex">
                            <button class="btn btn-success mr-2" id="printtable">Chop etish</button>
                            <form action="{{ route('applicationend') }}"
                                  method="POST">
                                @csrf
                                <input type="hidden" name="id" value="{{$data->id}}">
                                <button class="btn btn-danger mr-2" type="submit">Yakunlash</button>
                            </form>
                        </div>
                        </div>
                    </div>
                </div>
                <!-- Tabs with Icon ends -->


            </div>

        </div>
    </div>



@endsection

@section('js')
    <script src="https://cdn.jsdelivr.net/npm/print-this/printThis.min.js"></script>
    <script>
        $(document).ready(function() {
            $('#printtable').click(function() {
                $('#print').printThis({
                    importCSS: true,
                    importStyle: true,
                    deferredLoading: true
                });
            });
        });
    </script>
@endsection
